## Overview

Load data and arrange dataset
Define a new column 'status' which signifies adopted users

## load data

In [1]:
# import library
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# load excel
user_engagement = pd.read_csv("takehome_user_engagement.csv")
#user_engagement = pd.read_csv("takehome_users.csv")

In [3]:
user_engagement.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 207917 entries, 0 to 207916
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   time_stamp  207917 non-null  object
 1   user_id     207917 non-null  int64
 2   visited     207917 non-null  int64
dtypes: int64(2), object(1)
memory usage: 4.8+ MB

In [4]:
len(pd.unique(user_engagement['user_id']))

8823

In [3]:
users = pd.read_csv("takehome_users.csv", encoding='latin-1')

In [4]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12000 entries, 0 to 11999
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   object_id                   12000 non-null  int64
 1   creation_time               12000 non-null  object
 2   name                        12000 non-null  object
 3   email                       12000 non-null  object
 4   creation_source             12000 non-null  object
 5   last_session_creation_time  8823 non-null   float64
 6   opted_in_to_mailing_list    12000 non-null  int64
 7   enabled_for_marketing_drip  12000 non-null  int64
 8   org_id                      12000 non-null  int64
 9   invited_by_user_id          6417 non-null   float64
dtypes: float64(2), int64(4), object(4)
memory usage: 937.6+ KB

In [8]:
len(pd.unique(users['object_id']))

12000

In [6]:
user_engagement.head()

            time_stamp  user_id  visited
0  2014-04-22 03:53:30        1        1
1  2013-11-15 03:45:04        2        1
2  2013-11-29 03:45:04        2        1
3  2013-12-09 03:45:04        2        1
4  2013-12-25 03:45:04        2        1

In [7]:
users.head()

,object_id,creation_time,name,email,creation_source,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id
0,1,2014-04-22 03:53:30,Clausen August,AugustCClausen@yahoo.com,GUEST_INVITE,1.398139e+09,1,0,11,10803.0
1,2,2013-11-15 03:45:04,Poole Matthew,MatthewPoole@gustr.com,ORG_INVITE,1.396238e+09,0,0,1,316.0
2,3,2013-03-19 23:14:52,Bottrill Mitchell,MitchellBottrill@gustr.com,ORG_INVITE,1.363735e+09,0,0,94,1525.0
3,4,2013-05-21 08:09:28,Clausen Nicklas,NicklasSClausen@yahoo.com,GUEST_INVITE,1.369210e+09,0,0,1,5151.0
4,5,2013-01-17 10:14:20,Raw Grace,GraceRaw@yahoo.com,GUEST_INVITE,1.358850e+09,0,0,193,5240.0

## arrange dataset

In [5]:
user_engagement['user_id'] = user_engagement['user_id'].astype(object)

## treat missing values

In [6]:
users['last_session_creation_time'].fillna(value = users['last_session_creation_time'].mean(),
          inplace = True)

In [7]:
users['invited_by_user_id'].fillna(value = 'NA',
          inplace = True)

In [8]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12000 entries, 0 to 11999
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   object_id                   12000 non-null  int64
 1   creation_time               12000 non-null  object
 2   name                        12000 non-null  object
 3   email                       12000 non-null  object
 4   creation_source             12000 non-null  object
 5   last_session_creation_time  12000 non-null  float64
 6   opted_in_to_mailing_list    12000 non-null  int64
 7   enabled_for_marketing_drip  12000 non-null  int64
 8   org_id                      12000 non-null  int64
 9   invited_by_user_id          12000 non-null  object
dtypes: float64(1), int64(4), object(5)
memory usage: 937.6+ KB

## EDA

### Define adopted user

In [9]:
# define time_stamp as new index
user_engagement = user_engagement.set_index('time_stamp')
user_engagement.index = pd.to_datetime(user_engagement.index)

In [10]:
user_engagement.head()

                    user_id  visited
time_stamp
2014-04-22 03:53:30       1        1
2013-11-15 03:45:04       2        1
2013-11-29 03:45:04       2        1
2013-12-09 03:45:04       2        1
2013-12-25 03:45:04       2        1

In [11]:
# sort by user_id
user_engagement = user_engagement.sort_values('user_id')

In [12]:
user_engagement.head(10)

                    user_id  visited
time_stamp
2014-04-22 03:53:30       1        1
2014-03-31 03:45:04       2        1
2014-03-13 03:45:04       2        1
2014-03-09 03:45:04       2        1
2014-02-16 03:45:04       2        1
2014-02-13 03:45:04       2        1
2014-02-09 03:45:04       2        1
2014-02-08 03:45:04       2        1
2014-01-08 03:45:04       2        1
2013-12-31 03:45:04       2        1

In [13]:
# count the user_id and crerate new df 
user_id_count = user_engagement['user_id'].value_counts()

In [14]:
user_id_count = user_id_count.to_frame()
user_id_count = user_id_count.reset_index()

user_id_count.columns = user_id_count.columns.str.replace('user_id', 'counts')
user_id_count.columns = user_id_count.columns.str.replace('index', 'user_id')

In [15]:
user_id_count

      user_id  counts
0        3623     606
1         906     600
2        1811     593
3        7590     590
4        8068     585
...       ...     ...
8818     4699       1
8819     4698       1
8820     4697       1
8821     4696       1
8822    12000       1

[8823 rows x 2 columns]

In [16]:
# define new column status and Temporarily input as Adopted
user_id_count['status'] = 'Adopted'

In [17]:
user_id_count

      user_id  counts   status
0        3623     606  Adopted
1         906     600  Adopted
2        1811     593  Adopted
3        7590     590  Adopted
4        8068     585  Adopted
...       ...     ...      ...
8818     4699       1  Adopted
8819     4698       1  Adopted
8820     4697       1  Adopted
8821     4696       1  Adopted
8822    12000       1  Adopted

[8823 rows x 3 columns]

**time stamp is full 2 years. I think defining adopted user should be mean value of counts, not a user who has logged into the product on three separate days in at least one seven day period**

In [17]:
user_id_count.counts.mean()

23.565340587101893

In [18]:
# if counts is less than 24, define status as "Not Adopted"
for i in range(len(user_id_count)):
    #print(i)
    if user_id_count['counts'][i] < 24:
#        print(user_id_count['counts'][i])
        user_id_count['status'][i] = 'Not Adopted'
#        #print(user_id_count['status'][i])

/var/folders/3p/j9v4cftj6bv03_rdsgtmknsr0000gn/T/ipykernel_10672/2528482272.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  user_id_count['status'][i] = 'Not Adopted'

In [20]:
user_id_count['status'].value_counts()

Not Adopted    7666
Adopted        1157
Name: status, dtype: int64

In [21]:
user_id_count['user_id'] = user_id_count['user_id'].astype(object)

In [22]:
user_id_count.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8823 entries, 0 to 8822
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  8823 non-null   object
 1   counts   8823 non-null   int64
 2   status   8823 non-null   object
dtypes: int64(1), object(2)
memory usage: 206.9+ KB

### merge dataset (add status in the original dataframe)

In [23]:
user_engagement=user_engagement.merge(user_id_count[['status', 'user_id']], on = 'user_id', how = 'right')
#user_engagement.head()

In [24]:
user_engagement.status.value_counts()

Adopted        192432
Not Adopted     15485
Name: status, dtype: int64

In [25]:
user_id_count[(user_id_count.user_id == 2400)]

     user_id  counts       status
1157    2400      23  Not Adopted

In [26]:
user_engagement[(user_engagement.status == "Not Adopted")]

       user_id  visited       status
192432    2400        1  Not Adopted
192433    2400        1  Not Adopted
192434    2400        1  Not Adopted
192435    2400        1  Not Adopted
192436    2400        1  Not Adopted
...        ...      ...          ...
207912    4699        1  Not Adopted
207913    4698        1  Not Adopted
207914    4697        1  Not Adopted
207915    4696        1  Not Adopted
207916   12000        1  Not Adopted

[15485 rows x 3 columns]

In [27]:
del user_engagement['visited']
user_engagement.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 207917 entries, 0 to 207916
Data columns (total 2 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   user_id  207917 non-null  object
 1   status   207917 non-null  object
dtypes: object(2)
memory usage: 4.8+ MB

In [28]:
len(pd.unique(user_engagement['user_id']))

8823

In [29]:
user_engagement=user_engagement.drop_duplicates()

In [30]:
user_engagement.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8823 entries, 0 to 207916
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  8823 non-null   object
 1   status   8823 non-null   object
dtypes: object(2)
memory usage: 206.8+ KB

### merge dataset user_engagement and users

In [33]:
users.describe()

,object_id,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id
count,12000.00000,1.200000e+04,12000.000000,12000.000000,12000.000000
mean,6000.50000,1.379279e+09,0.249500,0.149333,141.884583
std,3464.24595,1.674708e+07,0.432742,0.356432,124.056723
min,1.00000,1.338452e+09,0.000000,0.000000,0.000000
25%,3000.75000,1.370563e+09,0.000000,0.000000,29.000000
50%,6000.50000,1.379279e+09,0.000000,0.000000,108.000000
75%,9000.25000,1.393729e+09,0.000000,0.000000,238.250000
max,12000.00000,1.402067e+09,1.000000,1.000000,416.000000

In [31]:
# match column name -- object_id => user_id
users.columns = users.columns.str.replace('object_id', 'user_id')
users.head()

,user_id,creation_time,name,email,creation_source,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id
0,1,2014-04-22 03:53:30,Clausen August,AugustCClausen@yahoo.com,GUEST_INVITE,1.398139e+09,1,0,11,10803.0
1,2,2013-11-15 03:45:04,Poole Matthew,MatthewPoole@gustr.com,ORG_INVITE,1.396238e+09,0,0,1,316.0
2,3,2013-03-19 23:14:52,Bottrill Mitchell,MitchellBottrill@gustr.com,ORG_INVITE,1.363735e+09,0,0,94,1525.0
3,4,2013-05-21 08:09:28,Clausen Nicklas,NicklasSClausen@yahoo.com,GUEST_INVITE,1.369210e+09,0,0,1,5151.0
4,5,2013-01-17 10:14:20,Raw Grace,GraceRaw@yahoo.com,GUEST_INVITE,1.358850e+09,0,0,193,5240.0

In [32]:
user_engagement['status'].value_counts()

Not Adopted    7666
Adopted        1157
Name: status, dtype: int64

In [33]:
# merge
new_users=users.merge(user_engagement[['status', 'user_id']], on = 'user_id', how = 'left')

In [34]:
new_users.head()

,user_id,creation_time,name,email,creation_source,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id,status
0,1,2014-04-22 03:53:30,Clausen August,AugustCClausen@yahoo.com,GUEST_INVITE,1.398139e+09,1,0,11,10803.0,Not Adopted
1,2,2013-11-15 03:45:04,Poole Matthew,MatthewPoole@gustr.com,ORG_INVITE,1.396238e+09,0,0,1,316.0,Not Adopted
2,3,2013-03-19 23:14:52,Bottrill Mitchell,MitchellBottrill@gustr.com,ORG_INVITE,1.363735e+09,0,0,94,1525.0,Not Adopted
3,4,2013-05-21 08:09:28,Clausen Nicklas,NicklasSClausen@yahoo.com,GUEST_INVITE,1.369210e+09,0,0,1,5151.0,Not Adopted
4,5,2013-01-17 10:14:20,Raw Grace,GraceRaw@yahoo.com,GUEST_INVITE,1.358850e+09,0,0,193,5240.0,Not Adopted

In [35]:
new_users['status'].value_counts()

Not Adopted    7666
Adopted        1157
Name: status, dtype: int64

In [37]:
new_users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12000 entries, 0 to 11999
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   user_id                     12000 non-null  object
 1   creation_time               12000 non-null  object
 2   name                        12000 non-null  object
 3   email                       12000 non-null  object
 4   creation_source             12000 non-null  object
 5   last_session_creation_time  12000 non-null  float64
 6   opted_in_to_mailing_list    12000 non-null  int64
 7   enabled_for_marketing_drip  12000 non-null  int64
 8   org_id                      12000 non-null  int64
 9   invited_by_user_id          12000 non-null  object
 10  status                      8823 non-null   object
dtypes: float64(1), int64(3), object(7)
memory usage: 1.1+ MB

### treat missing values

In [38]:
new_users['status'].fillna(value = 'NA',
          inplace = True)
new_users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12000 entries, 0 to 11999
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   user_id                     12000 non-null  object
 1   creation_time               12000 non-null  object
 2   name                        12000 non-null  object
 3   email                       12000 non-null  object
 4   creation_source             12000 non-null  object
 5   last_session_creation_time  12000 non-null  float64
 6   opted_in_to_mailing_list    12000 non-null  int64
 7   enabled_for_marketing_drip  12000 non-null  int64
 8   org_id                      12000 non-null  int64
 9   invited_by_user_id          12000 non-null  object
 10  status                      12000 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 1.1+ MB

In [39]:
new_users.status.value_counts()

Not Adopted    7666
NA             3177
Adopted        1157
Name: status, dtype: int64

In [40]:
new_users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12000 entries, 0 to 11999
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   user_id                     12000 non-null  object
 1   creation_time               12000 non-null  object
 2   name                        12000 non-null  object
 3   email                       12000 non-null  object
 4   creation_source             12000 non-null  object
 5   last_session_creation_time  12000 non-null  float64
 6   opted_in_to_mailing_list    12000 non-null  int64
 7   enabled_for_marketing_drip  12000 non-null  int64
 8   org_id                      12000 non-null  int64
 9   invited_by_user_id          12000 non-null  object
 10  status                      12000 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 1.1+ MB

## Create model